Service - Income Tax/archive/2022/sample messages/ErrorCode2227.txt

Error code 2227

Request
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r44:fileRequest xmlns:r44="urn:www.ird.govt.nz/GWS:types/ReturnIR44.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">018027631</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2021-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>44</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r44:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r44:residentialRentalIncome>
                                    <ic:totalIncome>123.45</ic:totalIncome>
                                    <ic:excessDeductionsBroughtForward>0.00</ic:excessDeductionsBroughtForward>
                                    <ic:deductionsClaimedThisYear>1000.00</ic:deductionsClaimedThisYear>
                                    <ic:netIncome>1100.00</ic:netIncome>
                                    <ic:excessDeductionsCarriedForward>0.00</ic:excessDeductionsCarriedForward>
                                </r44:residentialRentalIncome>
                                <r44:financialMarketsAuthorityNumber>1234</r44:financialMarketsAuthorityNumber>
                                <r44:fundBalanceDate>2019-03-31</r44:fundBalanceDate>
                                <r44:assetsIncludeNZLifeOrTransferred>false</r44:assetsIncludeNZLifeOrTransferred>
                                <r44:nzLifeOrTransfersTotalAssets>false</r44:nzLifeOrTransfersTotalAssets>
                                <r44:electionRequired>false</r44:electionRequired>
                                <r44:saleOfProperty>5678.99</r44:saleOfProperty>
                                <r44:fundIncome>1000.00</r44:fundIncome>
                                <r44:deductionsFromOtherSchemes>
                                    <ic:deduction>
                                        <ic:name>Johnny Bravo</ic:name>
                                        <ic:irdNumber>074407102</ic:irdNumber>
                                        <ic:amount>1000.00</ic:amount>
                                    </ic:deduction>
                                </r44:deductionsFromOtherSchemes>
                                <r44:totalDeductionsFromOtherSchemes>1000.00</r44:totalDeductionsFromOtherSchemes>
                                <r44:deductionsTreatedAsCapitalOnDisposal>0</r44:deductionsTreatedAsCapitalOnDisposal>
                                <r44:deductionsTreatedAsRevenueOnDisposal>0</r44:deductionsTreatedAsRevenueOnDisposal>
                                <r44:deductionsToOtherSchemes>
                                    <ic:deduction>
                                        <ic:name>Homer Simpson</ic:name>
                                        <ic:irdNumber>081734402</ic:irdNumber>
                                        <ic:amount>1000.00</ic:amount>
                                    </ic:deduction>
                                </r44:deductionsToOtherSchemes>
                                <r44:totalDeductionsToOtherSchemes>1000</r44:totalDeductionsToOtherSchemes>
                                <r44:additionsTreatedAsCapitalOnDisposal>0</r44:additionsTreatedAsCapitalOnDisposal>
                                <r44:additionsTreatedAsRevenueOnDisposal>0</r44:additionsTreatedAsRevenueOnDisposal>
                                <r44:lossesBroughtForward>0</r44:lossesBroughtForward>
                                <r44:lossCarriedBackPriorYear>0</r44:lossCarriedBackPriorYear>
                                <r44:totalTaxableIncome>8100.00</r44:totalTaxableIncome>
                                <r44:taxOnTaxableIncome>588.00</r44:taxOnTaxableIncome>
                                <r44:trusteeDetails>
                                    <ic:trustee>
                                        <ic:fullName>BoJack Horseman</ic:fullName>
                                        <ic:irdNumber>093612547</ic:irdNumber>
                                    </ic:trustee>
                                </r44:trusteeDetails>
                                <r44:fifOrCFCDisclosureRequired>false</r44:fifOrCFCDisclosureRequired>
                                <r44:investmentsDisposedOfDuringYear>false</r44:investmentsDisposedOfDuringYear>
                                <r44:investmentsDisposedOfDuringYearAmount>1000.00</r44:investmentsDisposedOfDuringYearAmount>
                                <r44:gainsOrLossesTreatedAsNonTaxable>false</r44:gainsOrLossesTreatedAsNonTaxable>
                                <r44:gainsOrLossesTreatedAsNonTaxableReason>string</r44:gainsOrLossesTreatedAsNonTaxableReason>
                                <r44:preApril1988InvestmentsDisposedOf>false</r44:preApril1988InvestmentsDisposedOf>
                                <r44:investmentsTreatedAsTradingStock>false</r44:investmentsTreatedAsTradingStock>
                                <r44:overseasTaxCredit>1000.00</r44:overseasTaxCredit>
                                <r44:imputationCredits>1000.00</r44:imputationCredits>
                                <r44:researchAndDevelopment>
                                    <ic:creditBroughtForward>0</ic:creditBroughtForward>
                                    <ic:nonrefundableCredit>0</ic:nonrefundableCredit>
                                    <ic:refundableCredit>0</ic:refundableCredit>
                                </r44:researchAndDevelopment>
                                <r44:rwtAndOtherTaxCredits>1000.00</r44:rwtAndOtherTaxCredits>
                                <r44:rlwtCredit>0</r44:rlwtCredit>
                                <r44:residualIncomeTax>-1000.00</r44:residualIncomeTax>
                                <r44:overpaymentProvisionalTax>1000.00</r44:overpaymentProvisionalTax>
                                <r44:provisionalTax>
                                    <ic:provisionalTaxOption>STD</ic:provisionalTaxOption>
                                    <ic:provisionalTaxPayable>1000</ic:provisionalTaxPayable>
                                    <ic:provisionalTaxStartDate>2018-08-01</ic:provisionalTaxStartDate>
                                </r44:provisionalTax>
                            </rc:formFields>
                        </rc:fileBody>
                    </r44:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>

Response
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
    <s:Header>
        <a:Action s:mustUnderstand="1">https://services.ird.govt.nz/GWS/Returns/Return/FileResponse</a:Action>
    </s:Header>
    <s:Body>
        <FileResponse xmlns="https://services.ird.govt.nz/GWS/Returns/">
            <FileResult xmlns:b="https://services.ird.govt.nz/GWS/Returns/:types/FileResponse" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <b:FileResponseWrapper>
                    <fileResponse xmlns="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <statusMessage xmlns="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <statusCode>2227</statusCode>
                            <errorMessage>residentialRentalIncome indicator is required if residentialRentalIncome totalIncome or residentialRentalIncome residentialRentalDeductions are non-zero values</errorMessage>
                        </statusMessage>
                    </fileResponse>
                </b:FileResponseWrapper>
            </FileResult>
        </FileResponse>
    </s:Body>
</s:Envelope>
